---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalCurveType.BaseCurve
enum: Autodesk.Revit.DB.Structure.AnalyticalCurveType
source: html/2c102724-4c8b-e648-31da-31fb383801fb.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalCurveType.BaseCurve

Default Analytical Model curve of linear elements (beams, braces, columns).